app/controllers/profils_controller.rb

SELECT "profils".* FROM "profils"
---
  def index
    @profils = Profil.all

INSERT INTO "profils" ("bio", "created_at", "land", "nachname", "ort", "profilname", "sprache", "updated_at", "user_id", "vorname") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "profil_id" = $1, "updated_at" = $2 WHERE "users"."id" = 6  [["profil_id", 7], ["updated_at", "2014-12-01 00:48:09.385454"]]
---
  def create
    @profil = Profil.new(profil_params)
    @profil.user_id = current_user.id

    respond_to do |format|
      if @profil.save
        format.html { redirect_to @profil, notice: 'Profil was successfully created.' }
        format.json { render :show, status: :created, location: @profil }

        #Nachdem ein Profil erstellt wurde speichert man die Profil ID in den user
        @user = User.find_by id: current_user.id
        @user.profil_id = @profil.id
        @user.save

SELECT  "profils".* FROM "profils"  WHERE "profils"."user_id" = 1 LIMIT 1
---
    def set_profil
      @profil = Profil.find_by user_id: current_user.id